Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_comp_type.h
/**************************************************************************//**
 * @defgroup COMP_WK_SHUT_CNT
 * @brief  Comparator Shutdown Counter Register      (@ 0X044)
 * @{
 *****************************************************************************/
#define COMP_SHIFT_POWON_CNT                         24
#define COMP_MASK_POWON_CNT                          ((u32)0x000000FF << 24)                             /*!<R/W 0x64  It is time delay between comparator trigger to read and LPSD[0] */
#define COMP_SHIFT_DATA_VALID_CNT                    16
#define COMP_MASK_DATA_VALID_CNT                     ((u32)0x000000FF << 16)                             /*!<R/W 0x6E  Data valid counter after turn on REG0X_LPSD[0] */
#define COMP_SHIFT_CHSW_CNT                          8
#define COMP_MASK_CHSW_CNT                           ((u32)0x000000FF << 8)                              /*!<R/W 0x3C  TBD */
#define COMP_SHIFT_WK_SHUT_CNT                       0
#define COMP_MASK_WK_SHUT_CNT                        ((u32)0x000000FF << 0)                              /*!<R/W 0x96  This eight bits defines how long to disable comparator analog module when an external trigger event is sent to the comparator. The count must include the comparator response time to get a correct compare result. */
/** @} */

/**************************************************************************//**
 * @defgroup rtl8735b_COMP
 * @{
 * @brief rtl8735b_COMP Register Declaration
 *****************************************************************************/
typedef struct {
	__IO uint32_t COMP_REF_CH0 ;                           /*!<  Comparator Channel 0 Reference Volatage Register register,  Address offset: 0x000 */
	__IO uint32_t COMP_REF_CH1 ;                           /*!<  Comparator Channel 1 Reference Volatage Register register,  Address offset: 0x004 */
	__IO uint32_t COMP_REF_CH2 ;                           /*!<  Comparator Channel 2 Reference Volatage Register register,  Address offset: 0x008 */
	__IO uint32_t COMP_REF_CH3 ;                           /*!<  Comparator Channel 3 Reference Volatage Register register,  Address offset: 0x00C */
	__IO uint32_t COMP_INTR_CTRL ;                         /*!<  Comparator Interrupt Control Register register,  Address offset: 0x010 */
	__IO uint32_t COMP_INTR_STS ;                          /*!<  Comparator Interrupt Status Register register,  Address offset: 0x014 */
	__I  uint32_t COMP_INTR_RAW_STS ;                      /*!<  Comparator Interrupt RAW Status Register register,  Address offset: 0x018 */
	__IO uint32_t COMP_ITEMSW_LIST ;                       /*!<  Comparator Item Switch List Register register,  Address offset: 0x01C */
	__I  uint32_t COMP_LAST_ITEM ;                         /*!<  Comparator Last Item Register register,  Address offset: 0x020 */
	__I  uint32_t COMP_BUSY ;                              /*!<  Comparator Busy Status Register register,  Address offset: 0x024 */
	__I  uint32_t COMP_CH_STS ;                            /*!<  Comparator Channel Status Register register,  Address offset: 0x028 */
	__IO uint32_t COMP_AUTO_SHUT ;                         /*!<  Comparator Auto Shutdown Register register,  Address offset: 0x02C */
	__IO uint32_t COMP_WK_TIMER ;                          /*!<  Comparator Wake Timer Control Reigster register,  Address offset: 0x030 */
	__IO uint32_t COMP_WK_TIMER_SEL ;                      /*!<  Comparator Wake Timer Select Reigster register,  Address offset: 0x034 */
	__IO uint32_t COMP_RST_LIST ;                          /*!<  Comparator Rest List Register register,  Address offset: 0x038 */
	__IO uint32_t COMP_AUTO_SW_EN ;                        /*!<  Comparator Auto Channel Switch Enable Reigster register,  Address offset: 0x03C */
	__IO uint32_t COMP_ENABLE ;                            /*!<  Comparator Enable Control Register register,  Address offset: 0x040 */
	__IO uint32_t COMP_WK_SHUT_CNT ;                       /*!<  Comparator Shutdown Counter Register register,          Address offset: 0x044 */
} COMP_TypeDef;
/** @} */

#endif
